app/views/alunos/_form.html.erb

    <%= form.label :turma_id, style: "display: block" %>
    <%= collection_select(:aluno, :turma_id, Turma.all, :id, :turma_completa) %>
---
SELECT "turmas".* FROM "turmas"