app/views/atividades/_form.html.erb

SELECT "disciplinas".* FROM "disciplinas"
---
    <%= form.label :disciplina_id, style: "display: block" %>
    <%= collection_select(:atividade, :disciplina_id, Disciplina.all, :id, :disciplina_completa) %>