app/views/avaliacaos/_form.html.erb

SELECT "atividades".* FROM "atividades"
---
    <%= form.label :atividade_id, style: "display: block" %>
    <%= collection_select(:avaliacao, :atividade_id, Atividade.all, :id, :atividade_completa) %>

SELECT "alunos".* FROM "alunos"
---
    <%= form.label :aluno_id, style: "display: block" %>
    <%= collection_select(:avaliacao, :aluno_id, Aluno.all, :id, :nome) %>