app/controllers/atividades_controller.rb

SELECT "atividades".* FROM "atividades"
---
  def index
    @atividades = Atividade.all

INSERT INTO "atividades" ("titulo", "bimestre", "descricao", "data", "disciplina_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @atividade = Atividade.new(atividade_params)

    respond_to do |format|
      if @atividade.save

DELETE FROM "atividades" WHERE "atividades"."id" = ?  [["id", 2]]
---
  def destroy
    @atividade.destroy

SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_atividade
      @atividade = Atividade.find(params[:id])