app/controllers/avaliacaos_controller.rb

  def index
    @avaliacaos = Avaliacao.all
---
SELECT "avaliacaos".* FROM "avaliacaos"

  def create
    @avaliacao = Avaliacao.new(avaliacao_params)

    respond_to do |format|
      if @avaliacao.save
---
INSERT INTO "avaliacaos" ("pontos", "observacoes", "atividade_id", "aluno_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["pontos", 3.0], ["observacoes", "asdasd"], ["atividade_id", 1], ["aluno_id", 1], ["created_at", "2022-10-17 23:45:56.201315"], ["updated_at", "2022-10-17 23:45:56.201315"]]

    def set_avaliacao
      @avaliacao = Avaliacao.find(params[:id])
---
SELECT "avaliacaos".* FROM "avaliacaos" WHERE "avaliacaos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]