app/controllers/disciplinas_controller.rb

  def index
    @disciplinas = Disciplina.all
---
SELECT "disciplinas".* FROM "disciplinas"

  def create
    @disciplina = Disciplina.new(disciplina_params)

    respond_to do |format|
      if @disciplina.save
---
INSERT INTO "disciplinas" ("nome", "anoLetivo", "turma_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", ""], ["anoLetivo", nil], ["turma_id", 1], ["created_at", "2022-10-17 15:23:43.730812"], ["updated_at", "2022-10-17 15:23:43.730812"]]

  def destroy
    @disciplina.destroy
---
DELETE FROM "disciplinas" WHERE "disciplinas"."id" = ?  [["id", 1]]

    def set_disciplina
      @disciplina = Disciplina.find(params[:id])
---
SELECT "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]