app/controllers/turmas_controller.rb

  def index
    @turmas = Turma.all
---
SELECT "turmas".* FROM "turmas"

  def create
    @turma = Turma.new(turma_params)

    respond_to do |format|
      if @turma.save
---
INSERT INTO "turmas" ("letra", "ano", "anoLetivo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["letra", "A"], ["ano", 5], ["anoLetivo", 2022], ["created_at", "2022-10-17 15:08:22.379542"], ["updated_at", "2022-10-17 15:08:22.379542"]]

    def set_turma
      @turma = Turma.find(params[:id])
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]