app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "jenio"], ["password_digest", "[FILTERED]"], ["created_at", "2022-10-18 02:49:44.431729"], ["updated_at", "2022-10-18 02:49:44.431729"]]